---
type: ReferenceArrayIterator
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# ReferenceArrayIterator

`Autodesk.Revit.DB.ReferenceArrayIterator` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ReferenceArrayIterator | — | `public ReferenceArrayIterator ()` |
| Method | MoveNext | — | `public virtual bool MoveNext ()` |
| Method | Reset | — | `public virtual void Reset ()` |
| Property | Current | — | `public virtual Object Current { get ; }` |